<a href="https://colab.research.google.com/github/mioyn/AdvDataProg/blob/main/Pandas_Intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Import pandas and numpy

import pandas as pd

In [2]:
my_series = pd.Series([10,23,33,43,53])
my_series

0    10
1    23
2    33
3    43
4    53
dtype: int64

In [11]:
my_series2 = pd.Series([10, 20, 30,40,50],index=['1996','1998','1999','2000','2001'])
my_series2

1996    10
1998    20
1999    30
2000    40
2001    50
dtype: int64

In [10]:
my_series2.values

array([10, 20, 30, 40, 50])

In [19]:
my_series2.index

Index(['1996', '1998', '1999', '2000', '2001'], dtype='object')

In [16]:
my_series2.iloc[3]

np.int64(40)

In [25]:
my_series2.iloc[3]

np.int64(40)

In [22]:
my_series2["2000"]

np.int64(40)

In [23]:
my_series2[["2000", "2001"]]

2000    40
2001    50
dtype: int64

In [26]:
my_series = pd.Series([10, 20, 30,40,50],index=['row1','row2','row3','row4','row5'])
my_series[my_series>=20]

row2    20
row3    30
row4    40
row5    50
dtype: int64